<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ProjectShemaSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('name_of_schemas')->insert([  
            [
                'name' => 'જંકશન સુધારણા',
            ], [
                'name' => 'વર્તુળની સુધારણા',
            ], [
                'name' => 'બાયપાસ માટે જમીન સંપાદન',
            ],
            [
                'name' => 'રાજયધોરી માર્ગો માટે જમીન સંપાદન',
            ],
            [
                'name' => 'વળાંકોની સુધારણા',
            ],
            [
                'name' => 'મહાનગરોને જોડતા રસ્‍તા',
            ],
            [
                'name' => 'પાર્કીંગ પ્લેસીસ',
            ],
            [
                'name' => 'પ્રાવર્તક નિશાની બોર્ડ',
            ],
            [
                'name' => 'હુમ પાઈપના સ્થાને સ્‍લેબડ્રેઈન',
            ],
            [
                'name' => 'નવા ઉદ્યોગો',
            ],
            [
                'name' => 'હયાત ઉદ્યોગો',
            ],
            [
                'name' => 'નબળા / સાંકડા પુલો',
            ],
            [
                'name' => 'ઢોળાવોની જગ્‍યાએ ગરનાળા/ પુલો',
            ],
            [
                'name' => 'રાજયધોરી માર્ગ પર ખુટતી કડી',
            ],
            [
                'name' => 'નબળા પુલો સંગીન બનાવવા',
            ],
            [
                'name' => 'વિકાસ પથ',
            ],
            [
                'name' => 'તાલુકાથી તાલુકા',
            ],
            [
                'name' => 'ઘેડ એરીયા ',
            ],

            [
                'name' => 'રોડ સેફટી ઓડીટ',
            ],
            [
                'name' => 'ખુટતી કડીના પુલો',
            ],
            [
                'name' => 'પુર તથા ભારે વરસાદથી નુકશાન પામેલ પુલો',
            ],

            [
                'name' => 'સબમર્જ સેકશન',
            ],
            [
                'name' => 'સ્‍ટાન્‍ડર્ડ ટુ લેન',
            ],
            [
                'name' => 'બંદરોને જોડતા રસ્‍તા',
            ],
            [
                'name' => 'જિલ્‍લા મથકો વચ્‍ચે ૧૦.મી. રોડનું જોડાણ',
            ],
            [
                'name' => 'વિકાસપથ જેવી સુવિઘા',
            ],
            [
                'name' => 'બાયપાસ',
            ],
            [
                'name' => 'અકસ્‍માત સ્‍થળોની સુધારણા',
            ],
            [
                'name' => 'નગપાલિકામાંથી પસાર થતા વિકાસપથને ફરીથી સમતલ કરવા',
            ],
            [
                'name' => '૭ વર્ષ થયેલ એમ.ડી.આર./ઓ.ડી.આર. ને સમતલ કરવા',
            ],
            [
                'name' => 'લેન્ડ બેંક',
            ],
            [
                'name' => 'ઐદ્યોગિક વિસ્તારો, બંદરો, ડી.એફ.સી.સી./ ડી.એમ.આઈ.સી વિગેરેને જોડતા રસ્‍તા ૪ માર્ગીય',
            ],
            [
                'name' => 'સ્‍ટેચ્‍યુ ઓફ યુનિટીને જોડતા રસ્‍તા',
            ],
            [
                'name' => 'વિકાસપથ વિસ્તરણ',
            ],
            [
                'name' => 'નવરચિત તાલુકા મથકે વિકાસપથ',
            ],
            [
                'name' => 'પ્રગતિપથ ચાર માર્ગીયકરણ',
            ],
            [
                'name' => 'પંચાયતમાંથી તબદીલ થયેલ મુ.જી.મા.ને પહોળા/ મજબુત કરવા.',
            ],
            [
                'name' => 'કોર નેટવર્કમાં સમાવેલ રસ્તાઓનું સેફટીઓડીટ કરાવી બ્લેક સ્પોટ સુઘારણાની કામગીરી',
            ],
            [
                'name' => 'ફલાયઓવર અન્ડરપાસ જેવી ગ્રેડ સેપરેટર સુવિઘા',
            ],
            [
                'name' => 'મહેસાણા-શંખેશ્વર વચ્ચે પગદંડી',
            ],
            [
                'name' => 'વારંવાર અકસ્માત તથા હોય તેવા અનુભાગોનું સેફટી ઓડીટ અને સુધારણાં',
            ],


            [
                'name' => '૧૦ મીટર પહોળાઇનો કોસ્ટલ હાઇવે ',
            ],
            [
                'name' => '૬ ટુરીસ્ટ સરકીટના રસ્તાઓ',
            ],
            [
                'name' => 'હાઇસ્પીડ કોરીડોર',
            ],
            [
                'name' => 'પરિક્રમાપથ',
            ],

            [
                'name' => 'ગીફટ સીટી માટે રસ્તાનું અપગ્રેડેશન, નવો માર્ગ જમીન સંપાદન સહિત',
            ],
            [
                'name' => 'કામનાથ થી ગડોદર મીસીંગ લીન્ક',
            ],
            [
                'name' => 'કન્સલટન્સી ફોર સેલ્ફ ઓફ પ્રોજેકટ',
            ],
            [
                'name' => 'પ્રવાસીપથ',
            ],
            [
                'name' => '૭ વર્ષથી રીસરફેસ ન થયેલ વી.આર.',
            ],
            [
                'name' => 'બ્રીજ ૧૦૧',
            ],
            [
                'name' => 'જિલ્‍લાવાર છાપેલી આઈટમો-પુલો',
            ],
            [
                'name' => 'બેઠા પુલો તથા ડુબમા જતા પુલોની જગ્‍યાએ મોટા પુલો',
            ],
            [
                'name' => 'રાજયમાં નવા પુલોનું બાંઘકામ',
            ],  [
                'name' => 'જુનાં પુલોનું સર્વે ઇન્વેસ્ટીગેશન/ મજબુતીકરણ/પુન: બાંઘકામ',
            ],
            [
                'name' => 'મીઢોળા નદી પર પુલ',
            ],
            [
                'name' => '૧૦ મીટર પહોળાઇના કોસ્ટલ હાઇવે માટે ખુટતી કડીના પુલો',
            ],
            [
                'name' => 'ખાસ મરામત 3054 SR',
            ],
            [
                'name' => 'તાલુકા થી તાલુકા',
            ],
            [
                'name' => 'પ્રવાસીપથ',
            ],
            [
                'name' => 'સ્‍ટાન્‍ડર્ડ ટુ લેન',
            ],
            [
                'name' => 'પુલોને મજબુત બનાવવા/પુનઃ નિર્માણ',
            ],
            [
                'name' => 'રાજય માર્ગો પરના નબળા  અને સાંકડા નાળા / નાના પુલો પહોળા અને પુનઃ નિર્માણ',
            ],
            [
                'name' => 'ઢોળાવોની જગ્‍યાએ ગરનાળા/ પુલો',
            ],
            [
                'name' => '૭ વર્ષ થયેલ એમ.ડી.આર./ઓ.ડી.આર. ને સમતલ કરવા',
            ],
            [
                'name' => '૭ વર્ષ થયેલ ગ્રામ્‍ય માર્ગોનું રીસરફેસીંગ',
            ], [
                'name' => 'નવા પુલો',
            ], [
                'name' => 'નવરચિત તાલુકા મથકે વિકાસપથ',
            ], [
                'name' => 'પ્રગતિપથ ચાર માર્ગીયકરણ',
            ],
            [
                'name' => 'વિકાસપથ વિસ્તરણ',
            ],
            [
                'name' => 'ફલાયઓવર / અન્ડર પાસ',
            ],
            [
                'name' => 'પંચાયતમાંથી તબદીલ થયેલ રસ્તા',
            ],
            [
                'name' => 'વારંવાર અકસ્માત તથા હોય તેવા સ્થળોની સુધારણાં',
            ],
            [
                'name' => 'જુનાં પુલોનું સર્વે',
            ],
            [
                'name' => '૧૦ મીટર પહોળાઇનો  એસ.ઓ.યુ.ને જોડતો રસ્તો મીસીંગ લીન્ક સહિત ',
            ],
            [
                'name' => 'પ્રવાસન સ્થળોને જોડતા રસ્તાઓને ટુરીસ્ટ સરકીટ તરીકે વિકસાવવા',
            ],
            [
                'name' => 'પરિક્રમાપથ',
            ],
            [
                'name' => 'ડાંગ જિલ્‍લાઓના રસ્‍તાનું કામ',
            ],

        ]);
    }
}
